#include<iostream>

using namespace std;

void map_1_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | /\\ |    | \\/ | " << "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_2_1(){

    cout << "~+~~~~+~~~~+~~~~+~" <<    "  Стрелочка     - Сокровище." << endl;
    cout << " | || | /\\ | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ | \\/ | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<    "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<    "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_3_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | /\\ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | \\/ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_4_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " | /\\ |    |    | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " | \\/ |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_5_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    | /\\ |    | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    | \\/ |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_6_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    | /\\ | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    | \\/ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_7_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " | /\\ |    | |/ | " << endl;
    cout << " | \\/ |    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_8_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\| /\\ | |/ | " << endl;
    cout << " |\\__/| \\/ | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_9_1(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | || |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | /\\ | " << endl;
    cout << " |\\__/|    | \\/ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}


void map_1_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " | /\\ |    | \\/ | " << "  Крестик       - Противник." << endl;
    cout << " | \\/ |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_2_2(){

    cout << "~+~~~~+~~~~+~~~~+~" <<    "  Стрелочка     - Сокровище." << endl;
    cout << " |    | /\\ | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    | \\/ | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<    "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<    "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_3_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | /\\ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | \\/ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_4_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " | /\\ |    |    | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " | \\/ |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_5_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    | /\\ |    | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    | \\/ |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_6_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    | /\\ | " <<  "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    | \\/ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | |/ | " << endl;
    cout << " |\\__/|    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_7_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " | /\\ |    | |/ | " << endl;
    cout << " | \\/ |    | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_8_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\| /\\ | |/ | " << endl;
    cout << " |\\__/| \\/ | |\\ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}

void map_9_2(){
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Стрелочка     - Сокровище." << endl;
    cout << " |    |    | \\/ | " <<  "  Крестик       - Противник." << endl;
    cout << " |    |    | /\\ | " << "  Буква 'K'     - Казарма." << endl;
    cout << "~+~~~~+~~~~+~~~~+~" <<   "  Ромб          - Ваш герой." << endl;
    cout << " |    |    |    | " <<   "  Полубуква 'О' - Ваш замок." << endl;
    cout << " |    |    |    | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl;
    cout << " |/''\\|    | /\\ | " << endl;
    cout << " |\\__/|    | \\/ | " << endl;
    cout << "~+~~~~+~~~~+~~~~+~" << endl << endl;
}